app/views/beers/show.html.haml

SELECT "notes".* FROM "notes"  WHERE "notes"."beer_id" = ?  [["beer_id", 1]]
---
		%p
		= "#{bg} a ajouté la note #{bg.notes.map{|n| n.value}.join(" et ").to_s} à cette bière"