app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
---
  def index
    @beers = Beer.all

INSERT INTO "beers" ("created_at", "description", "name", "note", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-10-05 07:38:54.117958"], ["description", "une bonne blonde bien fraiche\r\n"], ["name", "carlsberg"], ["note", 8], ["updated_at", "2015-10-05 07:38:54.117958"]]
---
  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save

UPDATE "beers" SET "description" = ?, "note" = ?, "updated_at" = ? WHERE "beers"."id" = 8  [["description", ""], ["note", 5], ["updated_at", "2015-10-12 11:14:13.886843"]]
---
  def update
    respond_to do |format|
      if @beer.update(beer_params)

DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 1]]
---
  def destroy
    @beer.destroy

SELECT  "beers".* FROM "beers"  WHERE "beers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_beer
      @beer = Beer.find(params[:id])